In [ ]:
import seaborn as sns
import numpy as np
import pandas as pd

In [30]:
df = sns.load_dataset('healthexp')
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [34]:
# Covariance and Correlation

In [ ]:
y = df.select_dtypes(include='number').cov()

In [51]:
y.corr()

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.999999         0.999999
Spending_USD     0.999999      1.000000         0.999997
Life_Expectancy  0.999999      0.999997         1.000000

In [46]:
df1 = sns.load_dataset('flights')

In [47]:
df1.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [48]:
x = df1.select_dtypes(include = 'number').cov()

In [49]:
x

                  year    passengers
year         12.000000    383.087413
passengers  383.087413  14391.917201

In [50]:
x.corr()

            year  passengers
year         1.0         1.0
passengers   1.0         1.0